zhengwang721/ASF/sam0/utils/cmsis/samd20/include/component/component_ptc.h
/* -------- PTC_INTENCLR : (PTC Offset: 0x08) (R/W  8) Interrupt Enable Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  EOC:1;            /*!< bit:      0  End of Conversion Interrupt Disable */
    uint8_t  WCOMP:1;          /*!< bit:      1  Window Compare Interrupt Disable   */
    uint8_t  READY:1;          /*!< bit:      2  Ready Interrupt Disable            */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_INTENCLR_OFFSET         0x08         /**< \brief (PTC_INTENCLR offset) Interrupt Enable Clear Register */
#define PTC_INTENCLR_RESETVALUE     0x00         /**< \brief (PTC_INTENCLR reset_value) Interrupt Enable Clear Register */

#define PTC_INTENCLR_EOC_Pos        0            /**< \brief (PTC_INTENCLR) End of Conversion Interrupt Disable */
#define PTC_INTENCLR_EOC            (0x1u << PTC_INTENCLR_EOC_Pos)
#define PTC_INTENCLR_WCOMP_Pos      1            /**< \brief (PTC_INTENCLR) Window Compare Interrupt Disable */
#define PTC_INTENCLR_WCOMP          (0x1u << PTC_INTENCLR_WCOMP_Pos)
#define PTC_INTENCLR_READY_Pos      2            /**< \brief (PTC_INTENCLR) Ready Interrupt Disable */
#define PTC_INTENCLR_READY          (0x1u << PTC_INTENCLR_READY_Pos)
#define PTC_INTENCLR_MASK           0x07u        /**< \brief (PTC_INTENCLR) MASK Register */

/* -------- PTC_INTENSET : (PTC Offset: 0x09) (R/W  8) Interrupt Enable Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  EOC:1;            /*!< bit:      0  End of Conversion Interrupt Enable */
    uint8_t  WCOMP:1;          /*!< bit:      1  Window Compare Interrupt Enable    */
    uint8_t  READY:1;          /*!< bit:      2  Ready Interrupt Enable             */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_INTENSET_OFFSET         0x09         /**< \brief (PTC_INTENSET offset) Interrupt Enable Set Register */
#define PTC_INTENSET_RESETVALUE     0x00         /**< \brief (PTC_INTENSET reset_value) Interrupt Enable Set Register */

#define PTC_INTENSET_EOC_Pos        0            /**< \brief (PTC_INTENSET) End of Conversion Interrupt Enable */
#define PTC_INTENSET_EOC            (0x1u << PTC_INTENSET_EOC_Pos)
#define PTC_INTENSET_WCOMP_Pos      1            /**< \brief (PTC_INTENSET) Window Compare Interrupt Enable */
#define PTC_INTENSET_WCOMP          (0x1u << PTC_INTENSET_WCOMP_Pos)
#define PTC_INTENSET_READY_Pos      2            /**< \brief (PTC_INTENSET) Ready Interrupt Enable */
#define PTC_INTENSET_READY          (0x1u << PTC_INTENSET_READY_Pos)
#define PTC_INTENSET_MASK           0x07u        /**< \brief (PTC_INTENSET) MASK Register */

/* -------- PTC_INTFLAG : (PTC Offset: 0x0A) (R/W  8) Interrupt Flag Status and Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  EOC:1;            /*!< bit:      0  End of Conversion Interrupt Flag   */
    uint8_t  WCOMP:1;          /*!< bit:      1  Window Compare Interrupt Flag      */
    uint8_t  READY:1;          /*!< bit:      2  Ready Interrupt Flag               */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_INTFLAG_OFFSET          0x0A         /**< \brief (PTC_INTFLAG offset) Interrupt Flag Status and Clear Register */
#define PTC_INTFLAG_RESETVALUE      0x00         /**< \brief (PTC_INTFLAG reset_value) Interrupt Flag Status and Clear Register */

#define PTC_INTFLAG_EOC_Pos         0            /**< \brief (PTC_INTFLAG) End of Conversion Interrupt Flag */
#define PTC_INTFLAG_EOC             (0x1u << PTC_INTFLAG_EOC_Pos)
#define PTC_INTFLAG_WCOMP_Pos       1            /**< \brief (PTC_INTFLAG) Window Compare Interrupt Flag */
#define PTC_INTFLAG_WCOMP           (0x1u << PTC_INTFLAG_WCOMP_Pos)
#define PTC_INTFLAG_READY_Pos       2            /**< \brief (PTC_INTFLAG) Ready Interrupt Flag */
#define PTC_INTFLAG_READY           (0x1u << PTC_INTFLAG_READY_Pos)
#define PTC_INTFLAG_MASK            0x07u        /**< \brief (PTC_INTFLAG) MASK Register */

/* -------- PTC_CTSCTRLA : (PTC Offset: 0x0C) (R/W  8) CTS Control Register A -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  SDS:4;            /*!< bit:  0.. 3  Sampling Delay Selection           */
    uint8_t  ASDV:1;           /*!< bit:      4  Automatic Sampling Delay Variation */
    uint8_t  CCDS:2;           /*!< bit:  5.. 6  Channel Change Delay Selection     */
    uint8_t  :1;               /*!< bit:      7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CTSCTRLA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CTSCTRLA_OFFSET         0x0C         /**< \brief (PTC_CTSCTRLA offset) CTS Control Register A */
#define PTC_CTSCTRLA_RESETVALUE     0x00         /**< \brief (PTC_CTSCTRLA reset_value) CTS Control Register A */

#define PTC_CTSCTRLA_SDS_Pos        0            /**< \brief (PTC_CTSCTRLA) Sampling Delay Selection */
#define PTC_CTSCTRLA_SDS_Msk        (0xFu << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS(value)     ((PTC_CTSCTRLA_SDS_Msk & ((value) << PTC_CTSCTRLA_SDS_Pos)))
#define PTC_CTSCTRLA_ASDV_Pos       4            /**< \brief (PTC_CTSCTRLA) Automatic Sampling Delay Variation */
#define PTC_CTSCTRLA_ASDV           (0x1u << PTC_CTSCTRLA_ASDV_Pos)
#define PTC_CTSCTRLA_CCDS_Pos       5            /**< \brief (PTC_CTSCTRLA) Channel Change Delay Selection */
#define PTC_CTSCTRLA_CCDS_Msk       (0x3u << PTC_CTSCTRLA_CCDS_Pos)
#define PTC_CTSCTRLA_CCDS(value)    ((PTC_CTSCTRLA_CCDS_Msk & ((value) << PTC_CTSCTRLA_CCDS_Pos)))
#define PTC_CTSCTRLA_MASK           0x7Fu        /**< \brief (PTC_CTSCTRLA) MASK Register */

